Jhnatek/sjtwo-c2/projects/lpc40xx_freertos/l5_application/gpio_lab.c
#include "gpio_lab.h"
#include "FreeRTOS.h"
#include "LPC40xx.h"
#include <stdio.h>

// Going to start with Port 2

/// Should alter the hardware registers to set the pin as input
void gpiO__set_as_input(uint8_t port_num, uint8_t pin_num) {
  if (port_num == 0) {
    LPC_GPIO0->DIR &= ~(1 << pin_num);
  } else if (port_num == 1) {
    LPC_GPIO1->DIR &= ~(1 << pin_num);
  } else if (port_num == 2) {
    LPC_GPIO2->DIR &= ~(1 << pin_num);
  } else {
    puts("port number outside of range\n");
    // LPC_GPIO2->DIR &= ~(1 << pin_num);
  }
}

/// Should alter the hardware registers to set the pin as output
void gpiO__set_as_output(uint8_t port_num, uint8_t pin_num) {
  if (port_num == 0) {
    LPC_GPIO0->DIR |= (1 << pin_num);
  } else if (port_num == 1) {
    LPC_GPIO1->DIR |= (1 << pin_num);
  } else if (port_num == 2) {
    LPC_GPIO2->DIR |= (1 << pin_num);
  } else {
    puts("port number outside of range\n");
  }
  // LPC_GPIO2->DIR |= (1 << pin_num);
}

/// Should alter the hardware registers to set the pin as high
// void gpio2__set_high(uint8_t pin_num) { LPC_GPIO2->PIN |= (1 << pin_num); }

void gpiO__set_high(uint8_t port_num, uint8_t pin_num) { // checked, should all work
  if (port_num == 0) {
    LPC_GPIO0->PIN |= (1 << pin_num);
  } else if (port_num == 1) {
    LPC_GPIO1->PIN |= (1 << pin_num);
  } else if (port_num == 2) {
    LPC_GPIO2->PIN |= (1 << pin_num);
  } else {
    puts("port number outside of range\n");
  }
}

/// Should alter the hardware registers to set the pin as low
void gpiO__set_low(uint8_t port_num, uint8_t pin_num) { // checked, should all work
  if (port_num == 0) {
    LPC_GPIO0->PIN &= ~(1 << pin_num);
  } else if (port_num == 1) {
    LPC_GPIO1->PIN &= ~(1 << pin_num);
  } else if (port_num == 2) {
    LPC_GPIO2->PIN &= ~(1 << pin_num);
  } else {
    puts("port number outside of range\n");
  }
}

/**
 * Should alter the hardware registers to set the pin as low
 *
 * @param {bool} high - true => set pin high, false => set pin low
 */
// void gpio2__set(uint8_t pin_num, bool high) {

//   if (high == true) {
//     gpio2__set_high(pin_num);
//   } else {
//     gpio2__set_low(pin_num);
//   }
// }

void gpiO__set(uint8_t port_num, uint8_t pin_num, bool high) { // not sure if works
  if (port_num == 0) {
    if (high == true) {
      gpiO__set_high(port_num, pin_num);
    } else {
      gpiO__set_low(port_num, pin_num);
    }
  } else if (port_num == 1) {
    if (high == true) {
      gpiO__set_high(port_num, pin_num);
    } else {
      gpiO__set_low(port_num, pin_num);
    }
  } else if (port_num == 2) {
    if (high == true) {
      gpiO__set_high(port_num, pin_num);
    } else {
      gpiO__set_low(port_num, pin_num);
    }
  } else {
    puts("port number outside of range\n");
  }
}

/**
 * Should return the state of the pin (input or output, doesn't matter)
 *
 * @return {bool} level of pin high => true, low => false
 */
// bool gpio2__get_level(uint8_t pin_num) {

//   if (LPC_GPIO2->PIN & (1 << pin_num)) {
//     return true;
//   } else {
//     return false;
//   }
// }

bool gpiO__get_level(uint8_t port_num, uint8_t pin_num) {
  if (port_num == 0) {
    if (LPC_GPIO0->PIN & (1 << pin_num)) {
      return true;
    } else {
      return false;
    }
  } else if (port_num == 1) {
    if (LPC_GPIO1->PIN & (1 << pin_num)) {
      return true;
    } else {
      return false;
    }
  } else if (port_num == 2) {
    if (LPC_GPIO2->PIN & (1 << pin_num)) {
      return true;
    } else {
      return false;
    }
  } else {
    puts("port number outside of range\n");
  }
}